Homework Task 4 - Pandas Challenge

In [1]:
# Import the Dependencies.

import pandas as pd

In [2]:
# Files to Read from:

file_schools = "Resources/schools_complete.csv"
file_students = "Resources/students_complete.csv"

In [3]:
# Create Data Frames.

school_data_df = pd.read_csv(file_schools)
student_data_df = pd.read_csv(file_students)

In [4]:
# Display the newly formed school Data Frame.

school_data_df.head(3)

   School ID           school_name      type  size   budget
0          0     Huang High School  District  2917  1910635
1          1  Figueroa High School  District  2949  1884411
2          2   Shelton High School   Charter  1761  1056600

In [5]:
# Display the newly formed student Data Frame.

student_data_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [6]:
school_data_merged_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])

In [7]:
school_data_merged_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [8]:
# Calculate the total number of schools in the district.

unique_schools=school_data_merged_df["school_name"].unique()
number_schools=len(unique_schools)
number_schools

15

In [9]:
# Calculate the total number of students in the district.

unique_students=school_data_merged_df["Student ID"].unique()
number_students=len(unique_students)
number_students

39170

In [10]:
# Calculate the average Maths score in the district.

average_maths=school_data_merged_df["math_score"].mean()
average_maths

78.98537145774827

In [11]:
# Calculate the average Reading score in the district.

average_reading=school_data_merged_df["reading_score"].mean()
average_reading

81.87784018381414

In [12]:
# Compile a list of all the different schools budget figure for the district.

unique_budget=school_data_merged_df["budget"].unique()
unique_budget

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130], dtype=int64)

In [13]:
# Check to ensure that there were no duplicate budget figure on the list. 

if len(unique_budget)==number_schools:
    print("All schools have a unique budget figure. All budget calcutions will be correct from this point.")
else:
    print("There is one or more repeated budget figures in the merged data frame. All repeated budget figures must be added to 'Total District Budget' figure below.")

All schools have a unique budget figure. All budget calcutions will be correct from this point.

In [14]:
# Determine the Total District Budget:

total_budget=unique_budget.sum()
total_budget

24649428

In [15]:
#Determine which students scored 70 or higher in Maths.

passing_maths_df=school_data_merged_df.loc[school_data_merged_df["math_score"] >= 70, ["budget","type","Student ID", "math_score", "school_name"]]

# Determine how many students scored 70 or higher in Maths.

unique_passing_maths=passing_maths_df["Student ID"].unique()
number_passing_maths=len(unique_passing_maths)

# Determine the percentage of students who scored 70 or higher in Maths.

percentage_passing_maths=100*number_passing_maths/number_students
percentage_passing_maths

74.9808526933878

In [16]:
#Determine which students scored 70 or higher in Reading.

passing_reading_df=school_data_merged_df.loc[school_data_merged_df["reading_score"] >= 70, ["Student ID", "math_score", "school_name"]]

# Determine how many students scored 70 or higher in Reading.

unique_passing_reading=passing_reading_df["Student ID"].unique()
number_passing_reading=len(unique_passing_reading)

# Determine the percentage of students who scored 70 or higher in Reading.

percentage_passing_reading=100*number_passing_reading/number_students
percentage_passing_reading

85.80546336482001

In [17]:
#Determine which students scored 70 or higher in Reading and Maths.

passing_both_df=passing_reading_df.loc[passing_reading_df["math_score"] >= 70, ["Student ID"]]

# Determine how many students scored 70 or higher in Reading and Maths.

unique_passing_both=passing_both_df["Student ID"].unique()
number_passing_both=len(unique_passing_both)

# # Determine the percentage of students who scored 70 or higher in Reading and Maths.

percentage_passing_both=100*number_passing_both/number_students
percentage_passing_both

65.17232575950983

In [18]:
#Create a new Data Frame with the appropriate column headings:

district_summary_df = pd.DataFrame([{"Number of Schools":number_schools,"Number of Students":number_students,"Budget":total_budget,"Average Maths Score":average_maths,"Average Reading Score":average_reading,"% Passing Maths":percentage_passing_maths,"% Passing Reading":percentage_passing_reading,"% Pass Maths and Reading":percentage_passing_both}])
district_summary_df

,Number of Schools,Number of Students,Budget,Average Maths Score,Average Reading Score,% Passing Maths,% Passing Reading,% Pass Maths and Reading
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [19]:
# Create a Data Frame called "Schools_Summary_df".

Schools_Summary_df=pd.DataFrame()

# Add the unique_school list as elements in the first column, "School Name".

Schools_Summary_df['school_name']=unique_schools

# Sort the School Names alphabetically.

Schools_Summary_df.sort_values(by='school_name', inplace=True)

Schools_Summary_df

              school_name
7      Bailey High School
6     Cabrera High School
1    Figueroa High School
13       Ford High School
4     Griffin High School
3   Hernandez High School
8      Holden High School
0       Huang High School
12    Johnson High School
9        Pena High School
11  Rodriguez High School
2     Shelton High School
14     Thomas High School
5      Wilson High School
10     Wright High School

In [20]:
# Determine each school's reading average.

reading_average=school_data_merged_df.groupby(['school_name'])['reading_score'].mean()

# Convert it to a data frame for future merging.

reading_average_df=pd.DataFrame({"reading_average": reading_average})
reading_average_df

                       reading_average
school_name
Bailey High School           81.033963
Cabrera High School          83.975780
Figueroa High School         81.158020
Ford High School             80.746258
Griffin High School          83.816757
Hernandez High School        80.934412
Holden High School           83.814988
Huang High School            81.182722
Johnson High School          80.966394
Pena High School             84.044699
Rodriguez High School        80.744686
Shelton High School          83.725724
Thomas High School           83.848930
Wilson High School           83.989488
Wright High School           83.955000

In [21]:
# Determine each school's maths average.

maths_average=school_data_merged_df.groupby(['school_name'])['math_score'].mean()

# Convert it to a data frame for future merging.

maths_average_df=pd.DataFrame({"maths_average": maths_average})
maths_average_df

                       maths_average
school_name
Bailey High School         77.048432
Cabrera High School        83.061895
Figueroa High School       76.711767
Ford High School           77.102592
Griffin High School        83.351499
Hernandez High School      77.289752
Holden High School         83.803279
Huang High School          76.629414
Johnson High School        77.072464
Pena High School           83.839917
Rodriguez High School      76.842711
Shelton High School        83.359455
Thomas High School         83.418349
Wilson High School         83.274201
Wright High School         83.682222

In [22]:
# Determine each schools Enrolment count.

school_enrolments=school_data_merged_df.groupby(['school_name'])["Student ID"].count()

# Convert it to a data frame for future merging.

school_enrolments_df=pd.DataFrame({"school_enrolments": school_enrolments})
school_enrolments_df

                       school_enrolments
school_name
Bailey High School                  4976
Cabrera High School                 1858
Figueroa High School                2949
Ford High School                    2739
Griffin High School                 1468
Hernandez High School               4635
Holden High School                   427
Huang High School                   2917
Johnson High School                 4761
Pena High School                     962
Rodriguez High School               3999
Shelton High School                 1761
Thomas High School                  1635
Wilson High School                  2283
Wright High School                  1800

In [23]:
# Group the list of students passing maths by School Name.

group_passing_maths=passing_maths_df.groupby(['school_name'])

# Determine the size of each group.

school_students_passing_maths=group_passing_maths.size()

# Convert it to a data frame for future merging.

school_students_passing_maths_df=pd.DataFrame({"school_students_passing_maths": school_students_passing_maths})
school_students_passing_maths_df

                       school_students_passing_maths
school_name
Bailey High School                              3318
Cabrera High School                             1749
Figueroa High School                            1946
Ford High School                                1871
Griffin High School                             1371
Hernandez High School                           3094
Holden High School                               395
Huang High School                               1916
Johnson High School                             3145
Pena High School                                 910
Rodriguez High School                           2654
Shelton High School                             1653
Thomas High School                              1525
Wilson High School                              2143
Wright High School                              1680

In [24]:
# Group the list of students passing reading by School Name.

group_passing_reading=passing_reading_df.groupby(['school_name'])

# Determine the size of each group.

school_students_passing_reading=group_passing_reading.size()

# Convert it to a data frame for future merging.

school_students_passing_reading_df=pd.DataFrame({"school_students_passing_reading": school_students_passing_reading})
school_students_passing_reading_df

                       school_students_passing_reading
school_name
Bailey High School                                4077
Cabrera High School                               1803
Figueroa High School                              2381
Ford High School                                  2172
Griffin High School                               1426
Hernandez High School                             3748
Holden High School                                 411
Huang High School                                 2372
Johnson High School                               3867
Pena High School                                   923
Rodriguez High School                             3208
Shelton High School                               1688
Thomas High School                                1591
Wilson High School                                2204
Wright High School                                1739

In [25]:
# Determine each School Type.

school_type_df=group_passing_maths.first()

# Delete unneeded columns from Data Frame.

del school_type_df['Student ID']
del school_type_df['math_score']
del school_type_df['budget']

school_type_df

                           type
school_name
Bailey High School     District
Cabrera High School     Charter
Figueroa High School   District
Ford High School       District
Griffin High School     Charter
Hernandez High School  District
Holden High School      Charter
Huang High School      District
Johnson High School    District
Pena High School        Charter
Rodriguez High School  District
Shelton High School     Charter
Thomas High School      Charter
Wilson High School      Charter
Wright High School      Charter

In [26]:
# Determine each School Budget.

school_budget_df=group_passing_maths.first()

# Delete unneeded columns from Data Frame.

del school_budget_df['Student ID']
del school_budget_df['math_score']
del school_budget_df['type']

school_budget_df

                        budget
school_name
Bailey High School     3124928
Cabrera High School    1081356
Figueroa High School   1884411
Ford High School       1763916
Griffin High School     917500
Hernandez High School  3022020
Holden High School      248087
Huang High School      1910635
Johnson High School    3094650
Pena High School        585858
Rodriguez High School  2547363
Shelton High School    1056600
Thomas High School     1043130
Wilson High School     1319574
Wright High School     1049400

In [27]:
Schools_Summary_df1=pd.merge(Schools_Summary_df, reading_average_df, how="left", on=["school_name"])
Schools_Summary_df2=pd.merge(Schools_Summary_df1, maths_average_df, how="left", on=["school_name"])
Schools_Summary_df2

              school_name  reading_average  maths_average
0      Bailey High School        81.033963      77.048432
1     Cabrera High School        83.975780      83.061895
2    Figueroa High School        81.158020      76.711767
3        Ford High School        80.746258      77.102592
4     Griffin High School        83.816757      83.351499
5   Hernandez High School        80.934412      77.289752
6      Holden High School        83.814988      83.803279
7       Huang High School        81.182722      76.629414
8     Johnson High School        80.966394      77.072464
9        Pena High School        84.044699      83.839917
10  Rodriguez High School        80.744686      76.842711
11    Shelton High School        83.725724      83.359455
12     Thomas High School        83.848930      83.418349
13     Wilson High School        83.989488      83.274201
14     Wright High School        83.955000      83.682222

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type